DataProcessors/РегистрыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РегистрыРасчета</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

CalculationRegisters/ОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.ЗначениеЧасы</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

DataProcessors/РегистрыРасчета/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьБазу(Команда)
	
	ПолучитьБазуСервер(РазовыеНачисления);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьБазуСервер(РазовыеНачисления)

	Отбор = Новый Структура("Регистратор", РазовыеНачисления);
	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", "ОсновныеНачисления.Сотрудник");
	Измерения.Вставить("Подразделение", "ОсновныеНачисления.Подразделение");
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ОсновныеНачисления.Результат");
	
	Таблица = РегистрыРасчета.ДополнительныеНачисления.ПолучитьБазу(Отбор, Ресурсы,Измерения);
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ДополнительныеНачисления.Результат");
	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", "ДополнительныеНачисления.Сотрудник");
	Измерения.Вставить("Подразделение", "ДополнительныеНачисления.Подразделение");
	
	Таблица = РегистрыРасчета.ДополнительныеНачисления.ПолучитьБазу(Отбор, Ресурсы,Измерения);
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ОсновныеНачисления.Результат,ДополнительныеНачисления.Результат");
	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", "ОсновныеНачисления.Сотрудник,ДополнительныеНачисления.Сотрудник");
	Измерения.Вставить("Подразделение", "ОсновныеНачисления.Подразделение,ДополнительныеНачисления.Подразделение");
	
	Таблица = РегистрыРасчета.ДополнительныеНачисления.ПолучитьБазу(Отбор, Ресурсы,Измерения);
	
	Набор = РазовыеНачисления.ПолучитьОбъект().Движения.ДополнительныеНачисления;
	Набор.Прочитать();
	Для каждого Запись Из Набор Цикл
		
		Строка = Таблица.Найти(Запись.НомерСтроки, "НомерСтроки");
		Если Строка=Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Запись.Результат = Запись.Размер*Строка.Результат/100;
	
	КонецЦикла; 
	
	Набор.Записать();

КонецПроцедуры // ПолучитьБазуСервер(НачислениеЗП()

&НаКлиенте
Процедура ПолучитьГрафик(Команда)
	ПолучитьГрафикСервер(НачислениеЗП);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьГрафикСервер(НачислениеЗП)

	Отбор = Новый Структура("Регистратор", НачислениеЗП);
	//График = РегистрыРасчета.ОсновныеНачисления.ПолучитьДанныеГрафика(Отбор,
	//ВидПериодаРегистраРасчета.БазовыйПериод);
	//
	//Сообщить("Базовый период = "+График[0][1]);

	График = РегистрыРасчета.ОсновныеНачисления.ПолучитьДанныеГрафика(Отбор,
	ВидПериодаРегистраРасчета.ПериодДействия);
	Сообщить("Период дейсвтия= "+График[0][1]);
	
	График = РегистрыРасчета.ОсновныеНачисления.ПолучитьДанныеГрафика(Отбор,
	ВидПериодаРегистраРасчета.ПериодРегистрации);
	Сообщить("Период регистрации = "+График[0][1]);
	
	График = РегистрыРасчета.ОсновныеНачисления.ПолучитьДанныеГрафика(Отбор,
	ВидПериодаРегистраРасчета.ФактическийПериодДействия);
	Сообщить("ФПД = "+График[0][1]);
	
КонецПроцедуры // ПолучитьГрафикСервер(НачислениеЗП)()

&НаКлиенте
Процедура ПолучитьБазуЗапросом(Команда)
	ПолучитьБазуЗапросомСервер(РазовыеНачисления);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ПолучитьБазуЗапросомСервер(РазовыеНачисления)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.ВидРасчета,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Сотрудник,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Подразделение,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.Размер,
	               |	ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза
	               |ИЗ
	               |	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(&Измерения, &Измерения, , Регистратор = &Регистратор) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Измерения.Добавить("Подразделение");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", РазовыеНачисления);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Сообщить(Таблица.Итог("РезультатБаза"));
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", РазовыеНачисления);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Сообщить(Таблица.Итог("РезультатБаза"));	

	Измерения = Новый Массив;
	Измерения.Добавить("Подразделение");
	Запрос.УстановитьПараметр("Регистратор", РазовыеНачисления);
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Сообщить(Таблица.Итог("РезультатБаза"));	
КонецПроцедуры // ПолучитьБазуЗапросомСервер()

&НаСервереБезКонтекста
Процедура ИерархияКлассовНаСервере()
	Выборка =ПланыВидовРасчета.ПланВидовРасчета1.Выбрать();
	Пока Выборка.Следующий() Цикл
	     Сообщить(Выборка.Наименование)
		
	
	КонецЦикла;
	//ВыборкаИзРегистраРасчета=	РегистрыРасчета.ОсновныеНачисления.Выбрать();
	//Пока ВыборкаИзРегистраРасчета.Следующий() Цикл
	//	
	//	Сообщить(ВыборкаИзРегистраРасчета.ВидРасчета);
	//	Сообщить(ВыборкаИзРегистраРасчета.ПериодДействия);
	//	Сообщить(ВыборкаИзРегистраРасчета.Размер);
	//	Сообщить(ВыборкаИзРегистраРасчета.Результат);
	//	
	//КонецЦикла;
	//
КонецПроцедуры

&НаКлиенте
Процедура ИерархияКлассов(Команда)
	ИерархияКлассовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБазуПоНачислению(Команда)
	ПолучитьБазуСервер(НачислениеЗП);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБазуЗапросом1(Команда)
	ПолучитьБазуЗапросомСервер(НачислениеЗП);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьБазу1НаСервере(НачислениеЗП)
	Отбор = Новый Структура("Регистратор", НачислениеЗП);
    Ресурсы = Новый Массив;
	Ресурсы.Добавить("ОсновныеНачисления.Результат,ДополнительныеНачисления.Результат");
	Измерения = Новый Структура;
	Измерения.Вставить("Сотрудник", "ОсновныеНачисления.Сотрудник,ДополнительныеНачисления.Сотрудник");
	Измерения.Вставить("Подразделение", "ОсновныеНачисления.Подразделение,ДополнительныеНачисления.Подразделение");
	
	Таблица = РегистрыРасчета.ДополнительныеНачисления.ПолучитьБазу(Отбор, Ресурсы,Измерения);
	
	Набор = НачислениеЗП.ПолучитьОбъект().Движения.ДополнительныеНачисления;
	Набор.Прочитать();
	Для каждого Запись Из Набор Цикл
		
		Строка = Таблица.Найти(Запись.НомерСтроки, "НомерСтроки");
		Если Строка=Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Запись.Результат = Запись.Размер*Строка.Результат/100;
	
	КонецЦикла; 
	
	Набор.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБазу1(Команда)
	ПолучитьБазу1НаСервере(НачислениеЗП);
КонецПроцедуры
